# Taps
tap "homebrew/bundle"

# System Tools
brew "git"
brew "gnupg"
brew "coreutils" # GNU versions of ls, cp, etc.
brew "gh"        # GitHub CLI

# Language Toolchains
brew "ocaml"
brew "opam"
brew "rustup"
brew "llvm"      # Better C++ tooling (clangd)
brew "cmake"

# Modern CLI Replacements
brew "fzf"       # Fuzzy finder
brew "ripgrep"   # Faster grep (rg)
brew "bat"       # Syntax highlighting for 'cat'
brew "eza"       # Modern 'ls' replacement

# Casks (GUI)
cask "iterm2"
cask "visual-studio-code"
cask "font-fira-code-nerd-font"
